БИТУправление_медицинским_центром_демо/src/Documents/ОбратнаяСвязь/ОбратнаяСвязь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбратнаяСвязь</name>
  <basedOn>Document.Рекламация</basedOn>
  <basedOn>Document.Событие</basedOn>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОбращения</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ОбъектыОбратнойСвязиКлиента</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРазбор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулировкаПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Формулировка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обоснованность</name>
    <type>
      <types>EnumRef.ОбоснованностьОбращения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/ТипОбъектаОбратнойСвязи/ТипОбъектаОбратнойСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОбъектаОбратнойСвязи</name>
  <enumValues>
    <name>НеУказывается</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ОбъектОбратнойСвязи</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/ОбратнаяСвязь/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);

	ЭтоНовый = Объект.Ссылка.Пустая();	
	Если ЭтоНовый Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Формулировка.УстановитьHTML(Объект.Формулировка, Новый Структура);
	КонецЕсли;
	
	Элементы.ГруппаЗакрытиеШапка.Доступность = ПравоДоступа("ИнтерактивноеИзменениеПроведенных", Метаданные.Документы.ОбратнаяСвязь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Формулировка.ПолучитьHTML(Объект.Формулировка, Новый Структура);
	Объект.ФормулировкаПредставление = Формулировка.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект, Истина, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			Объект.Клиент = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииТипОбращения()
	
	РеквизитыТипаОбращения = ПолучитьРеквизитыТипаОбращения(Объект.ТипОбращения, Объект.Филиал);
	ТипОбъекта = РеквизитыТипаОбращения.ТипОбъектаОбратнойСвязи;
		
	Если ТипОбъекта = ПредопределенноеЗначение("Перечисление.ТипОбъектаОбратнойСвязи.НеУказывается") Тогда
		Объект.ОбъектОбращения = Неопределено;
		Элементы.ОбъектОбращения.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ОбъектОбращения.АвтоОтметкаНезаполненного = Истина;
		Если ТипОбъекта = ПредопределенноеЗначение("Перечисление.ТипОбъектаОбратнойСвязи.Сотрудник") Тогда
			ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
			
		ИначеЕсли ТипОбъекта = ПредопределенноеЗначение("Перечисление.ТипОбъектаОбратнойСвязи.ОбъектОбратнойСвязи") Тогда
			ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ОбъектыОбратнойСвязиКлиента");
			
		ИначеЕсли ТипОбъекта = ПредопределенноеЗначение("Перечисление.ТипОбъектаОбратнойСвязи.Прочее") Тогда
			ОписаниеТипа = Новый ОписаниеТипов("Строка");
		Иначе
			ОписаниеТипа = Новый ОписаниеТипов("Неопределено");
		КонецЕсли;
		Объект.ОбъектОбращения = ОписаниеТипа.ПривестиЗначение(Объект.ОбъектОбращения);
	КонецЕсли;
	
	Если РеквизитыТипаОбращения.Ответственный <> Неопределено Тогда
		Объект.ОтветственныйЗаРазбор = РеквизитыТипаОбращения.Ответственный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыТипаОбращения(ТипОбращения, Филиал)
	
	Результат = Новый Структура("ТипОбъектаОбратнойСвязи, Ответственный", ТипОбращения.ТипОбъектаОбратнойСвязи, Неопределено);
	
	СтрокаОтветственный = ТипОбращения.Ответственные.Найти(Филиал, "Филиал");
	Если СтрокаОтветственный <> Неопределено Тогда
		Результат.Ответственный = СтрокаОтветственный.Ответственный;
	Иначе
		СтрокаОтветственный = ТипОбращения.Ответственные.Найти(Справочники.Филиалы.ПустаяСсылка(), "Филиал");
		Если СтрокаОтветственный <> Неопределено Тогда
			Результат.Ответственный = СтрокаОтветственный.Ответственный;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТипОбращенияПриИзменении(Элемент)
	ПриИзмененииТипОбращения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияУстановитьСегодня(Команда)
	
	Объект.ДатаЗакрытия = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,ЭтаФорма);
КонецПроцедуры

#КонецОбласти
